import React, {Component, useState} from 'react';

import Header from "../components/header/header";
import Sort from "../components/sort/sort";
import Card from "../components/card/card";
import blogBanner1 from "../assets/img/006.jpg";
import blogBanner2 from "../assets/img/005.jpg";
import blogBanner3 from "../assets/img/009.jpg";
import blogBanner4 from "../assets/img/007.jpg";
import blogBanner5 from "../assets/img/003.jpg";
import blogBanner6 from "../assets/img/008.jpg";
import Footer from "../components/footer/footer";


const Maghalat = (props) =>{

const [maghale,setMaghale] = useState([
         {
                id:1,
                docNumber: "مقاله شماره 1",
                    title: "میشه یه شبه برنامه نویس شد؟ ",
                    imgAddress: blogBanner1,
                    docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
                "                                                    اگر به صورت فریلنسری\n" +
                "                                                    هم کار می‌کنید مشتری",
                 desc: "برنامه نویس شدن آن هم یک شبه، حرفی ساده لوحانه است که متاسفانه تعدادی از افراد به علاقمندان یادگیری برنامه نویسی حرفی شبیه این موضوع را میزنند.\n" +
                 "\n" +
                 "در این راکت‌کست توضیح میدهم که برنامه نویس شدن راه و رسم خود را دارد و نمیتواند در یک شب، یا یک هفته یا یک ماه تبدیل به یک برنامه نویس کار کشته شد. باید زمان لازم برای تبدیل شدن به یک برنامه نویس طی شود تا شما بتوانید خود را برنامه نویس خطاب کنید.",

        },
        {
                id:2,
                docNumber: "مقاله شماره 2",
                    title: " نگاهی به نمونه کارهای شما ",
                    imgAddress: blogBanner2,
                    docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
                "                                                    اگر به صورت فریلنسری\n" +
                "                                                    هم کار می‌کنید مشتری",
            desc:"برای این‌که بتوانید رتبه صفحات وب‌تان را در گوگل بالا ببرید، چاره‌ای ندارید جز این که محتوای باکیفیت تولید کنید و بعد به کمک سئو آن را به دست مخاطبش برسانید. شاید فکر کنید تمام قضیه با کمک یک آژانس دیجیتال مارکتینگ یا یک کارشناس سئو حل می‌شود.\n" +
                "\n" +
                "اشتباه نکنید.\n" +
                "\n" +
                "کمک گرفتن از متخصصان حوزه دیجیتال مارکتینگ ضروری است، اما چطور می‌خواهید بهترین گزینه را انتخاب کنید؟ حتماً می‌دانید که سایت شما جای آزمون و خطا نیست. پس چاره چیست؟\n" +
                "\n" +
                "اگر می‌خواهید شرکت یا شخصی را برای سئو سایت‌تان انتخاب کنید، باید پیش از هر چیز نمونه کارهای سئو سایت آن شرکت یا شخص را بررسی کنید.\n" +
                "یک مثل قدیمی هست که می‌گوید: کار نیکو کردن از پر کردن است.\n" +
                "\n" +
                "پونه مدیا در کنار شماست تا صفحات وب‌تان را به صدر نتایج برتر گوگل برسانید. آن‌چه ما را از دیگران متمایز می‌کند، سابقه و پایداری‌مان در این حوزه است. همکاری با مطرح‌ترین برندهای ایرانی و به ثمر رساندن بیش از 200 پروژه سئو موفق گواه صحت ادعای ماست.",
        },
        {
            id:3,
            docNumber: "مقاله شماره 3",
                    title: "خودآموزی ، ورود به بازارکار ",
                    imgAddress: blogBanner3,
                    docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
                "                                                    اگر به صورت فریلنسری\n" +
                "                                                    هم کار می‌کنید مشتری",
            desc:"در حال حاضر، با گسترش علوم و تخصصی شدن مشاغل شرایط ورود به بازار کار نیز دستخوش تغییراتی شده است. یکی از راه‌های ورود به بازار کار، یادگیری مهارتهای شغلی ضروری می‌باشد. در این مقاله راجع به این مهارت‌ها صحبت خواهیم کرد.\n" +
                "\n" +
                "اگر دنبال کار می‌گردید و هنوز وارد بازار کار نشده‌اید، احتمالاً استرس و نگرانی زیادی دارید که بدون تجربه و سابقه‌ی کاری هیچ جا به شما کار نمی‌دهند. تمام این احساسات درست هستند. اما باور کنید یا نه در دنیای شغلی جدید چیزی فراتر از سابقه و تجربه برای مدیران و کارفرمایان اهمیت دارد. امروزه برای آن‌که بتوانید جایگاه محکمی در فضای کسب و کار برای خودتان دست و پا کنید، نیاز به کسب یک سری از مهارتهای شغلی ضروری دارید.",
        },
        {
                id:4,
                docNumber: "مقاله شماره 4",
                    title: " نگاهی به نمونه کارهای شما ",
                    imgAddress: blogBanner4,
                    docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
                "                                                    اگر به صورت فریلنسری\n" +
                "                                                    هم کار می‌کنید مشتری",
            desc:"برای این‌که بتوانید رتبه صفحات وب‌تان را در گوگل بالا ببرید، چاره‌ای ندارید جز این که محتوای باکیفیت تولید کنید و بعد به کمک سئو آن را به دست مخاطبش برسانید. شاید فکر کنید تمام قضیه با کمک یک آژانس دیجیتال مارکتینگ یا یک کارشناس سئو حل می‌شود.\n" +
                "\n" +
                "اشتباه نکنید.\n" +
                "\n" +
                "کمک گرفتن از متخصصان حوزه دیجیتال مارکتینگ ضروری است، اما چطور می‌خواهید بهترین گزینه را انتخاب کنید؟ حتماً می‌دانید که سایت شما جای آزمون و خطا نیست. پس چاره چیست؟\n" +
                "\n" +
                "اگر می‌خواهید شرکت یا شخصی را برای سئو سایت‌تان انتخاب کنید، باید پیش از هر چیز نمونه کارهای سئو سایت آن شرکت یا شخص را بررسی کنید.\n" +
                "یک مثل قدیمی هست که می‌گوید: کار نیکو کردن از پر کردن است.\n" +
                "\n" +
                "پونه مدیا در کنار شماست تا صفحات وب‌تان را به صدر نتایج برتر گوگل برسانید. آن‌چه ما را از دیگران متمایز می‌کند، سابقه و پایداری‌مان در این حوزه است. همکاری با مطرح‌ترین برندهای ایرانی و به ثمر رساندن بیش از 200 پروژه سئو موفق گواه صحت ادعای ماست.",

        },
         {
                id:5,
                docNumber: "مقاله شماره 5",
                    title: "میشه یه شبه برنامه نویس شد؟ ",
                    imgAddress: blogBanner5,
                    docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
                "                                                    اگر به صورت فریلنسری\n" +
                "                                                    هم کار می‌کنید مشتری",
             desc: "برنامه نویس شدن آن هم یک شبه، حرفی ساده لوحانه است که متاسفانه تعدادی از افراد به علاقمندان یادگیری برنامه نویسی حرفی شبیه این موضوع را میزنند.\n" +
                 "\n" +
                 "در این راکت‌کست توضیح میدهم که برنامه نویس شدن راه و رسم خود را دارد و نمیتواند در یک شب، یا یک هفته یا یک ماه تبدیل به یک برنامه نویس کار کشته شد. باید زمان لازم برای تبدیل شدن به یک برنامه نویس طی شود تا شما بتوانید خود را برنامه نویس خطاب کنید.",


         },
         {
                id:6,
                docNumber: "مقاله شماره 6",
                    title: "حرفه ایی شدن رو از امروز شروع کن ",
                    imgAddress: blogBanner6,
                    docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
                "                                                    اگر به صورت فریلنسری\n" +
                "                                                    هم کار می‌کنید مشتری",
             desc:"در زندگی پرمشغله‌ی امروز، تلاش برای رسیدن به رویای‌مان کار دشواری است. با وجود شغل تمام‌وقت و داشتن فرزند، این کار حتی غیرممکن به نظر می‌رسد. پس شما چه می‌کنید و چگونه زندگی‌تان را پیش می‌برید؟ اگر هر روز به طور هدفمند زمانی را به پیشرفت و بهسازی اختصاص ندهید، بی‌شک زمان زیادی را در این زندگی پرهیایو از دست خواهید داد. پیش از اینکه به خود بیایید، پیر و پژمرده، مبهوتِ این خواهید بود که عمرتان چقدر سریع گذشت! برای این که این بلا سرتان نیاید، شما هم ۸ کاری که افراد موفق قبل از ۸ صبح انجام می‌دهند، را انجام دهید.",
        },
    {
        id:7,
        docNumber: "مقاله شماره 7",
        title: "میشه یه شبه برنامه نویس شد؟ ",
        imgAddress: blogBanner1,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc: "برنامه نویس شدن آن هم یک شبه، حرفی ساده لوحانه است که متاسفانه تعدادی از افراد به علاقمندان یادگیری برنامه نویسی حرفی شبیه این موضوع را میزنند.\n" +
            "\n" +
            "در این راکت‌کست توضیح میدهم که برنامه نویس شدن راه و رسم خود را دارد و نمیتواند در یک شب، یا یک هفته یا یک ماه تبدیل به یک برنامه نویس کار کشته شد. باید زمان لازم برای تبدیل شدن به یک برنامه نویس طی شود تا شما بتوانید خود را برنامه نویس خطاب کنید.",



    },
    {
        id:8,
        docNumber: "مقاله شماره 8",
        title: " نگاهی به نمونه کارهای شما ",
        imgAddress: blogBanner2,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"برای این‌که بتوانید رتبه صفحات وب‌تان را در گوگل بالا ببرید، چاره‌ای ندارید جز این که محتوای باکیفیت تولید کنید و بعد به کمک سئو آن را به دست مخاطبش برسانید. شاید فکر کنید تمام قضیه با کمک یک آژانس دیجیتال مارکتینگ یا یک کارشناس سئو حل می‌شود.\n" +
            "\n" +
            "اشتباه نکنید.\n" +
            "\n" +
            "کمک گرفتن از متخصصان حوزه دیجیتال مارکتینگ ضروری است، اما چطور می‌خواهید بهترین گزینه را انتخاب کنید؟ حتماً می‌دانید که سایت شما جای آزمون و خطا نیست. پس چاره چیست؟\n" +
            "\n" +
            "اگر می‌خواهید شرکت یا شخصی را برای سئو سایت‌تان انتخاب کنید، باید پیش از هر چیز نمونه کارهای سئو سایت آن شرکت یا شخص را بررسی کنید.\n" +
            "یک مثل قدیمی هست که می‌گوید: کار نیکو کردن از پر کردن است.\n" +
            "\n" +
            "پونه مدیا در کنار شماست تا صفحات وب‌تان را به صدر نتایج برتر گوگل برسانید. آن‌چه ما را از دیگران متمایز می‌کند، سابقه و پایداری‌مان در این حوزه است. همکاری با مطرح‌ترین برندهای ایرانی و به ثمر رساندن بیش از 200 پروژه سئو موفق گواه صحت ادعای ماست.",


    },
    {
        id:9,
        docNumber: "مقاله شماره 9",
        title: "خودآموزی ، ورود به بازارکار ",
        imgAddress: blogBanner3,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"در حال حاضر، با گسترش علوم و تخصصی شدن مشاغل شرایط ورود به بازار کار نیز دستخوش تغییراتی شده است. یکی از راه‌های ورود به بازار کار، یادگیری مهارتهای شغلی ضروری می‌باشد. در این مقاله راجع به این مهارت‌ها صحبت خواهیم کرد.\n" +
            "\n" +
            "اگر دنبال کار می‌گردید و هنوز وارد بازار کار نشده‌اید، احتمالاً استرس و نگرانی زیادی دارید که بدون تجربه و سابقه‌ی کاری هیچ جا به شما کار نمی‌دهند. تمام این احساسات درست هستند. اما باور کنید یا نه در دنیای شغلی جدید چیزی فراتر از سابقه و تجربه برای مدیران و کارفرمایان اهمیت دارد. امروزه برای آن‌که بتوانید جایگاه محکمی در فضای کسب و کار برای خودتان دست و پا کنید، نیاز به کسب یک سری از مهارتهای شغلی ضروری دارید.",

    },
    {
        id:10,
        docNumber: "مقاله شماره 10",
        title: " نگاهی به نمونه کارهای شما ",
        imgAddress: blogBanner4,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"برای این‌که بتوانید رتبه صفحات وب‌تان را در گوگل بالا ببرید، چاره‌ای ندارید جز این که محتوای باکیفیت تولید کنید و بعد به کمک سئو آن را به دست مخاطبش برسانید. شاید فکر کنید تمام قضیه با کمک یک آژانس دیجیتال مارکتینگ یا یک کارشناس سئو حل می‌شود.\n" +
            "\n" +
            "اشتباه نکنید.\n" +
            "\n" +
            "کمک گرفتن از متخصصان حوزه دیجیتال مارکتینگ ضروری است، اما چطور می‌خواهید بهترین گزینه را انتخاب کنید؟ حتماً می‌دانید که سایت شما جای آزمون و خطا نیست. پس چاره چیست؟\n" +
            "\n" +
            "اگر می‌خواهید شرکت یا شخصی را برای سئو سایت‌تان انتخاب کنید، باید پیش از هر چیز نمونه کارهای سئو سایت آن شرکت یا شخص را بررسی کنید.\n" +
            "یک مثل قدیمی هست که می‌گوید: کار نیکو کردن از پر کردن است.\n" +
            "\n" +
            "پونه مدیا در کنار شماست تا صفحات وب‌تان را به صدر نتایج برتر گوگل برسانید. آن‌چه ما را از دیگران متمایز می‌کند، سابقه و پایداری‌مان در این حوزه است. همکاری با مطرح‌ترین برندهای ایرانی و به ثمر رساندن بیش از 200 پروژه سئو موفق گواه صحت ادعای ماست.",



    },
    {
        id:11,
        docNumber: "مقاله شماره 11",
        title: "میشه یه شبه برنامه نویس شد؟ ",
        imgAddress: blogBanner5,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc: "برنامه نویس شدن آن هم یک شبه، حرفی ساده لوحانه است که متاسفانه تعدادی از افراد به علاقمندان یادگیری برنامه نویسی حرفی شبیه این موضوع را میزنند.\n" +
            "\n" +
            "در این راکت‌کست توضیح میدهم که برنامه نویس شدن راه و رسم خود را دارد و نمیتواند در یک شب، یا یک هفته یا یک ماه تبدیل به یک برنامه نویس کار کشته شد. باید زمان لازم برای تبدیل شدن به یک برنامه نویس طی شود تا شما بتوانید خود را برنامه نویس خطاب کنید.",




    },
    {
        id:12,
        docNumber: "مقاله شماره 12",
        title: "حرفه ایی شدن رو از امروز شروع کن ",
        imgAddress: blogBanner6,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"در زندگی پرمشغله‌ی امروز، تلاش برای رسیدن به رویای‌مان کار دشواری است. با وجود شغل تمام‌وقت و داشتن فرزند، این کار حتی غیرممکن به نظر می‌رسد. پس شما چه می‌کنید و چگونه زندگی‌تان را پیش می‌برید؟ اگر هر روز به طور هدفمند زمانی را به پیشرفت و بهسازی اختصاص ندهید، بی‌شک زمان زیادی را در این زندگی پرهیایو از دست خواهید داد. پیش از اینکه به خود بیایید، پیر و پژمرده، مبهوتِ این خواهید بود که عمرتان چقدر سریع گذشت! برای این که این بلا سرتان نیاید، شما هم ۸ کاری که افراد موفق قبل از ۸ صبح انجام می‌دهند، را انجام دهید.",

    },
    {
        id:13,
        docNumber: "مقاله شماره 13",
        title: "میشه یه شبه برنامه نویس شد؟ ",
        imgAddress: blogBanner1,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc: "برنامه نویس شدن آن هم یک شبه، حرفی ساده لوحانه است که متاسفانه تعدادی از افراد به علاقمندان یادگیری برنامه نویسی حرفی شبیه این موضوع را میزنند.\n" +
            "\n" +
            "در این راکت‌کست توضیح میدهم که برنامه نویس شدن راه و رسم خود را دارد و نمیتواند در یک شب، یا یک هفته یا یک ماه تبدیل به یک برنامه نویس کار کشته شد. باید زمان لازم برای تبدیل شدن به یک برنامه نویس طی شود تا شما بتوانید خود را برنامه نویس خطاب کنید.",





    },
    {
        id:14,
        docNumber: "مقاله شماره 14",
        title: " نگاهی به نمونه کارهای شما ",
        imgAddress: blogBanner2,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"برای این‌که بتوانید رتبه صفحات وب‌تان را در گوگل بالا ببرید، چاره‌ای ندارید جز این که محتوای باکیفیت تولید کنید و بعد به کمک سئو آن را به دست مخاطبش برسانید. شاید فکر کنید تمام قضیه با کمک یک آژانس دیجیتال مارکتینگ یا یک کارشناس سئو حل می‌شود.\n" +
            "\n" +
            "اشتباه نکنید.\n" +
            "\n" +
            "کمک گرفتن از متخصصان حوزه دیجیتال مارکتینگ ضروری است، اما چطور می‌خواهید بهترین گزینه را انتخاب کنید؟ حتماً می‌دانید که سایت شما جای آزمون و خطا نیست. پس چاره چیست؟\n" +
            "\n" +
            "اگر می‌خواهید شرکت یا شخصی را برای سئو سایت‌تان انتخاب کنید، باید پیش از هر چیز نمونه کارهای سئو سایت آن شرکت یا شخص را بررسی کنید.\n" +
            "یک مثل قدیمی هست که می‌گوید: کار نیکو کردن از پر کردن است.\n" +
            "\n" +
            "پونه مدیا در کنار شماست تا صفحات وب‌تان را به صدر نتایج برتر گوگل برسانید. آن‌چه ما را از دیگران متمایز می‌کند، سابقه و پایداری‌مان در این حوزه است. همکاری با مطرح‌ترین برندهای ایرانی و به ثمر رساندن بیش از 200 پروژه سئو موفق گواه صحت ادعای ماست.",




    },
    {
        id:15,
        docNumber: "مقاله شماره 15",
        title: "خودآموزی ، ورود به بازارکار ",
        imgAddress: blogBanner3,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"در حال حاضر، با گسترش علوم و تخصصی شدن مشاغل شرایط ورود به بازار کار نیز دستخوش تغییراتی شده است. یکی از راه‌های ورود به بازار کار، یادگیری مهارتهای شغلی ضروری می‌باشد. در این مقاله راجع به این مهارت‌ها صحبت خواهیم کرد.\n" +
            "\n" +
            "اگر دنبال کار می‌گردید و هنوز وارد بازار کار نشده‌اید، احتمالاً استرس و نگرانی زیادی دارید که بدون تجربه و سابقه‌ی کاری هیچ جا به شما کار نمی‌دهند. تمام این احساسات درست هستند. اما باور کنید یا نه در دنیای شغلی جدید چیزی فراتر از سابقه و تجربه برای مدیران و کارفرمایان اهمیت دارد. امروزه برای آن‌که بتوانید جایگاه محکمی در فضای کسب و کار برای خودتان دست و پا کنید، نیاز به کسب یک سری از مهارتهای شغلی ضروری دارید.",


    },
    {
        id:16,
        docNumber: "مقاله شماره 16",
        title: " نگاهی به نمونه کارهای شما ",
        imgAddress: blogBanner4,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"برای این‌که بتوانید رتبه صفحات وب‌تان را در گوگل بالا ببرید، چاره‌ای ندارید جز این که محتوای باکیفیت تولید کنید و بعد به کمک سئو آن را به دست مخاطبش برسانید. شاید فکر کنید تمام قضیه با کمک یک آژانس دیجیتال مارکتینگ یا یک کارشناس سئو حل می‌شود.\n" +
            "\n" +
            "اشتباه نکنید.\n" +
            "\n" +
            "کمک گرفتن از متخصصان حوزه دیجیتال مارکتینگ ضروری است، اما چطور می‌خواهید بهترین گزینه را انتخاب کنید؟ حتماً می‌دانید که سایت شما جای آزمون و خطا نیست. پس چاره چیست؟\n" +
            "\n" +
            "اگر می‌خواهید شرکت یا شخصی را برای سئو سایت‌تان انتخاب کنید، باید پیش از هر چیز نمونه کارهای سئو سایت آن شرکت یا شخص را بررسی کنید.\n" +
            "یک مثل قدیمی هست که می‌گوید: کار نیکو کردن از پر کردن است.\n" +
            "\n" +
            "پونه مدیا در کنار شماست تا صفحات وب‌تان را به صدر نتایج برتر گوگل برسانید. آن‌چه ما را از دیگران متمایز می‌کند، سابقه و پایداری‌مان در این حوزه است. همکاری با مطرح‌ترین برندهای ایرانی و به ثمر رساندن بیش از 200 پروژه سئو موفق گواه صحت ادعای ماست.",





    },
    {
        id:17,
        docNumber: "مقاله شماره 17",
        title: "میشه یه شبه برنامه نویس شد؟ ",
        imgAddress: blogBanner5,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc: "برنامه نویس شدن آن هم یک شبه، حرفی ساده لوحانه است که متاسفانه تعدادی از افراد به علاقمندان یادگیری برنامه نویسی حرفی شبیه این موضوع را میزنند.\n" +
            "\n" +
            "در این راکت‌کست توضیح میدهم که برنامه نویس شدن راه و رسم خود را دارد و نمیتواند در یک شب، یا یک هفته یا یک ماه تبدیل به یک برنامه نویس کار کشته شد. باید زمان لازم برای تبدیل شدن به یک برنامه نویس طی شود تا شما بتوانید خود را برنامه نویس خطاب کنید.",






    },
    {
        id:18,
        docNumber: "مقاله شماره 18",
        title: "حرفه ایی شدن رو از امروز شروع کن ",
        imgAddress: blogBanner6,
        docDetails: "هنگام درخواست کار، شرکت‌ها نگاهی به نمونه کارهای شما دارند. حتی\n" +
            "                                                    اگر به صورت فریلنسری\n" +
            "                                                    هم کار می‌کنید مشتری",
        desc:"در زندگی پرمشغله‌ی امروز، تلاش برای رسیدن به رویای‌مان کار دشواری است. با وجود شغل تمام‌وقت و داشتن فرزند، این کار حتی غیرممکن به نظر می‌رسد. پس شما چه می‌کنید و چگونه زندگی‌تان را پیش می‌برید؟ اگر هر روز به طور هدفمند زمانی را به پیشرفت و بهسازی اختصاص ندهید، بی‌شک زمان زیادی را در این زندگی پرهیایو از دست خواهید داد. پیش از اینکه به خود بیایید، پیر و پژمرده، مبهوتِ این خواهید بود که عمرتان چقدر سریع گذشت! برای این که این بلا سرتان نیاید، شما هم ۸ کاری که افراد موفق قبل از ۸ صبح انجام می‌دهند، را انجام دهید.",

    }
]);
        return (
            <div>


                <Header menuList={props.menuList}/>
                <Sort placeholder={props.placeholder}/>
                <Card maghale={maghale}/>
                <Footer footerInfo={props.footerInfo}/>





            </div>
        );

}



export default Maghalat;