import React from "react";

const CourseInfo = () => {
  return (
    <>
      <div className="info">
        <h5 className="mt-4 info-title">آموزش جامع پایتون از صفر تا صد</h5>
        <p className="mt-2 info-des">
          این پایتون چیه که انقدر سر زبون ها افتاده و هرجا بری صحبتش هست؟زبان
          برنامه نویسی پایتون زبانی با یادگیری آسان تلقی میشود و به همین دلیل
          بسیاری از برنامه نویس های تازه کار آن را به عنوان زبان برنامه نویسی
          خود انتخاب میکنند.زیرا پایتون به عنوان یک زبان همه منظوره ساخته و
          توسعه داده شده است و محدود به توسعه و نوع خاصی از نرم افزار نیست.
        </p>
        <h5 className="mt-4 info-title">چرا باید از این دوره استفاده بکنم؟</h5>
        <p className="mt-2 info-des">
          داخل دوره ما به مسائلی مثل اینکه پایتون رو چه کسی ساخت و یا در چه سالی
          ایجاد شد و مسائلی این چنینی نمیپردازیم،شما دارید هزینه میکنید و وقت
          میزارید که پایتون یادبگیرید نه اینکه بدونید پایتون رو کی ساخت.
        </p>
        <h5 className="mt-4 info-title">پیش نیاز های این دوره</h5>
        <p className="mt-2 info-des">
          این دوره برای افرادی که هیچ گونه اشنایی با برنامه نویسی ندارن و همچمین
          افراد متوسط و افرادی که پایتون رو به صورت پیشرفته دنبال می کنند قابل
          استفاده می باشد.
        </p>
      </div>
    </>
  );
};

export default CourseInfo;
